7767517
201 241
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_69                  1 1 1 2
Convolution              conv_3                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_70                  1 1 3 4
Convolution              conv_4                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_71                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_5                   1 1 11 12 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_72                  1 1 12 13
Convolution              conv_6                   1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_73                  1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Concat                   cat_0                    3 1 7 9 16 17 0=0
Convolution              conv_7                   1 1 17 18 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_74                  1 1 18 19
Convolution              conv_8                   1 1 19 20 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_75                  1 1 20 21
Convolution              conv_9                   1 1 21 22 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_76                  1 1 22 23
Slice                    split_1                  1 2 23 24 25 -23300=2,32,32 1=0
Split                    splitncnn_1              1 3 25 26 27 28
Convolution              conv_10                  1 1 28 29 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_77                  1 1 29 30
Convolution              conv_11                  1 1 30 31 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_78                  1 1 31 32
BinaryOp                 add_1                    2 1 27 32 33 0=0
Split                    splitncnn_2              1 3 33 34 35 36
Convolution              conv_12                  1 1 36 37 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_79                  1 1 37 38
Convolution              conv_13                  1 1 38 39 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_80                  1 1 39 40
BinaryOp                 add_2                    2 1 35 40 41 0=0
Concat                   cat_1                    4 1 24 26 34 41 42 0=0
Convolution              conv_14                  1 1 42 43 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_81                  1 1 43 44
Split                    splitncnn_3              1 2 44 45 46
Convolution              conv_15                  1 1 46 47 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_82                  1 1 47 48
Convolution              conv_16                  1 1 48 49 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_83                  1 1 49 50
Slice                    split_2                  1 2 50 51 52 -23300=2,64,64 1=0
Split                    splitncnn_4              1 3 52 53 54 55
Convolution              conv_17                  1 1 55 56 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_84                  1 1 56 57
Convolution              conv_18                  1 1 57 58 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_85                  1 1 58 59
BinaryOp                 add_3                    2 1 54 59 60 0=0
Split                    splitncnn_5              1 3 60 61 62 63
Convolution              conv_19                  1 1 63 64 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_86                  1 1 64 65
Convolution              conv_20                  1 1 65 66 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_87                  1 1 66 67
BinaryOp                 add_4                    2 1 62 67 68 0=0
Concat                   cat_2                    4 1 51 53 61 68 69 0=0
Convolution              conv_21                  1 1 69 70 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_88                  1 1 70 71
Split                    splitncnn_6              1 2 71 72 73
Convolution              conv_22                  1 1 73 74 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_89                  1 1 74 75
Convolution              conv_23                  1 1 75 76 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_90                  1 1 76 77
Slice                    split_3                  1 2 77 78 79 -23300=2,128,128 1=0
Split                    splitncnn_7              1 3 79 80 81 82
Convolution              conv_24                  1 1 82 83 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_91                  1 1 83 84
Convolution              conv_25                  1 1 84 85 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_92                  1 1 85 86
BinaryOp                 add_5                    2 1 81 86 87 0=0
Concat                   cat_3                    3 1 78 80 87 88 0=0
Convolution              conv_26                  1 1 88 89 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_93                  1 1 89 90
Convolution              conv_27                  1 1 90 91 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Split                    splitncnn_8              1 2 91 92 93
Pooling                  maxpool2d_66             1 1 93 94 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_9              1 2 94 95 96
Pooling                  maxpool2d_67             1 1 96 97 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_10             1 2 97 98 99
Pooling                  maxpool2d_68             1 1 99 100 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 92 95 98 100 101 0=0
Convolution              conv_28                  1 1 101 102 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_94                  1 1 102 103
Split                    splitncnn_11             1 2 103 104 105
Interp                   upsample_125             1 1 105 106 0=1 1=2.0 2=2.0 6=0
Concat                   cat_5                    2 1 106 72 107 0=0
Convolution              conv_29                  1 1 107 108 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_95                  1 1 108 109
Slice                    split_4                  1 2 109 110 111 -23300=2,64,64 1=0
Split                    splitncnn_12             1 2 111 112 113
Convolution              conv_30                  1 1 113 114 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_96                  1 1 114 115
Convolution              conv_31                  1 1 115 116 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_97                  1 1 116 117
Concat                   cat_6                    3 1 110 112 117 118 0=0
Convolution              conv_32                  1 1 118 119 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_98                  1 1 119 120
Split                    splitncnn_13             1 2 120 121 122
Interp                   upsample_126             1 1 122 123 0=1 1=2.0 2=2.0 6=0
Concat                   cat_7                    2 1 123 45 124 0=0
Convolution              conv_33                  1 1 124 125 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_99                  1 1 125 126
Slice                    split_5                  1 2 126 127 128 -23300=2,32,32 1=0
Split                    splitncnn_14             1 2 128 129 130
Convolution              conv_34                  1 1 130 131 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_100                 1 1 131 132
Convolution              conv_35                  1 1 132 133 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_101                 1 1 133 134
Concat                   cat_8                    3 1 127 129 134 135 0=0
Convolution              conv_36                  1 1 135 136 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_102                 1 1 136 137
Split                    splitncnn_15             1 3 137 138 139 140
Convolution              conv_37                  1 1 140 141 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_103                 1 1 141 142
Concat                   cat_9                    2 1 142 121 143 0=0
Convolution              conv_38                  1 1 143 144 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_104                 1 1 144 145
Slice                    split_6                  1 2 145 146 147 -23300=2,64,64 1=0
Split                    splitncnn_16             1 2 147 148 149
Convolution              conv_39                  1 1 149 150 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_105                 1 1 150 151
Convolution              conv_40                  1 1 151 152 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_106                 1 1 152 153
Concat                   cat_10                   3 1 146 148 153 154 0=0
Convolution              conv_41                  1 1 154 155 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_107                 1 1 155 156
Split                    splitncnn_17             1 3 156 157 158 159
Convolution              conv_42                  1 1 159 160 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_108                 1 1 160 161
Concat                   cat_11                   2 1 161 104 162 0=0
Convolution              conv_43                  1 1 162 163 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_109                 1 1 163 164
Slice                    split_7                  1 2 164 165 166 -23300=2,128,128 1=0
Split                    splitncnn_18             1 2 166 167 168
Convolution              conv_44                  1 1 168 169 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_110                 1 1 169 170
Convolution              conv_45                  1 1 170 171 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_111                 1 1 171 172
Concat                   cat_12                   3 1 165 167 172 173 0=0
Convolution              conv_46                  1 1 173 174 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_112                 1 1 174 175
Split                    splitncnn_19             1 2 175 176 177
MemoryData               pnnx_100                 0 1 178 0=8400
Convolution              conv_47                  1 1 139 179 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_113                 1 1 179 180
Convolution              conv_48                  1 1 180 181 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_114                 1 1 181 182
Convolution              conv_49                  1 1 182 183 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_127              1 1 183 184 0=6400 1=64
Convolution              conv_50                  1 1 158 185 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_115                 1 1 185 186
Convolution              conv_51                  1 1 186 187 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_116                 1 1 187 188
Convolution              conv_52                  1 1 188 189 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_128              1 1 189 190 0=1600 1=64
Convolution              conv_53                  1 1 177 191 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_117                 1 1 191 192
Convolution              conv_54                  1 1 192 193 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_118                 1 1 193 194
Convolution              conv_55                  1 1 194 195 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_129              1 1 195 196 0=400 1=64
Concat                   cat_13                   3 1 184 190 196 197 0=1
Convolution              conv_56                  1 1 138 198 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_119                 1 1 198 199
Convolution              conv_57                  1 1 199 200 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_120                 1 1 200 201
Convolution              conv_58                  1 1 201 202 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_130              1 1 202 203 0=6400 1=1
Convolution              conv_59                  1 1 157 204 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_121                 1 1 204 205
Convolution              conv_60                  1 1 205 206 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_122                 1 1 206 207
Convolution              conv_61                  1 1 207 208 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_131              1 1 208 209 0=1600 1=1
Convolution              conv_62                  1 1 176 210 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_123                 1 1 210 211
Convolution              conv_63                  1 1 211 212 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_124                 1 1 212 213
Convolution              conv_64                  1 1 213 214 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_132              1 1 214 215 0=400 1=1
Concat                   cat_14                   3 1 203 209 215 216 0=1
Reshape                  reshape_133              1 1 197 217 0=8400 1=16 2=4
Permute                  transpose_136            1 1 217 218 0=2
Softmax                  softmax_1                1 1 218 219 0=0 1=1
Convolution              conv_65                  1 1 219 220 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_134              1 1 220 221 0=8400 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 222 0=8400 1=2
Split                    splitncnn_0              1 2 222 223 224
Slice                    chunk_0                  1 2 221 225 226 -23300=2,-233,-233 1=0
BinaryOp                 sub_6                    2 1 223 225 227 0=1
Split                    splitncnn_20             1 2 227 228 229
BinaryOp                 add_7                    2 1 224 226 230 0=0
Split                    splitncnn_21             1 2 230 231 232
BinaryOp                 add_8                    2 1 228 231 233 0=0
BinaryOp                 div_9                    1 1 233 234 0=3 1=1 2=2.0
BinaryOp                 sub_10                   2 1 232 229 235 0=1
Concat                   cat_15                   2 1 234 235 236 0=0
Reshape                  reshape_135              1 1 178 237 0=8400 1=1
BinaryOp                 mul_11                   2 1 236 237 238 0=2
Sigmoid                  sigmoid_0                1 1 216 239
Concat                   cat_16                   2 1 238 239 out0 0=0
